# LogicalOrFilter Constructor (ElementFilter, ElementFilter) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LogicalOrFilter Constructor (ElementFilter, ElementFilter)
LogicalOrFilter Class See Also
---
Constructs a new instance of the logical filter with two input filters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public LogicalOrFilter(
	ElementFilter filter1,
	ElementFilter filter2
)
```

Visual Basic
---
```text
Public Sub New ( _
	filter1 As ElementFilter, _
	filter2 As ElementFilter _
)
```

Visual C++
---
```text
public:
LogicalOrFilter(
	ElementFilter^ filter1,
	ElementFilter^ filter2
)
```

# ### Parameters
filter1
    Type: Autodesk.Revit.DB..::..ElementFilter The first filter.
filter2
    Type: Autodesk.Revit.DB..::..ElementFilter The second filter.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LogicalOrFilter Class
LogicalOrFilter Overload
Autodesk.Revit.DB Namespace